In [16]:
# Reading the DataFrame
import pandas as pd
grades = pd.read_csv("School_Grades.csv")

grades.head()

    ID Student ID FirstName LastName  Subject  Marks Grade
0  HC1       stu1    Ritika    Singh     Arts     92     A
1  HC2       stu1    Ritika    Singh     Math     96    A+
2  HC3       stu1    Ritika    Singh  Science     96    A+
3  HC4       stu1    Ritika    Singh  English     94     A
4  HC5       stu2      Yash  Agarwal     Arts    100    A+

In [20]:
# Selecting first three rows : Indexes start from 0 and the second index is exclusive
grades[0:3]

    ID Student ID FirstName LastName  Subject  Marks Grade
0  HC1       stu1    Ritika    Singh     Arts     92     A
1  HC2       stu1    Ritika    Singh     Math     96    A+
2  HC3       stu1    Ritika    Singh  Science     96    A+

In [24]:
# Selecting 2nd row : Indexes start from 0 and the second index is exclusive
grades[1:2]

    ID Student ID FirstName LastName Subject  Marks Grade
0  HC1       stu1    Ritika    Singh    Arts     92     A

    ID Student ID FirstName LastName Subject  Marks Grade
1  HC2       stu1    Ritika    Singh    Math     96    A+

In [33]:
# Taking a sample from grades data by selecting first five rows

grades_sample = grades[0:5]

In [26]:
# Selecting single column

grades_sample['Student ID']

0    stu1
1    stu1
2    stu1
3    stu1
4    stu2
Name: Student ID, dtype: object

In [30]:
# Selecting multiple columns

grades_sample[['Student ID','FirstName']]

  Student ID FirstName
0       stu1    Ritika
1       stu1    Ritika
2       stu1    Ritika
3       stu1    Ritika
4       stu2      Yash

In [32]:
# Can filter based on certain conditions on culumns

grades_sample[grades_sample['FirstName']=='Ritika']

    ID Student ID FirstName LastName  Subject  Marks Grade
0  HC1       stu1    Ritika    Singh     Arts     92     A
1  HC2       stu1    Ritika    Singh     Math     96    A+
2  HC3       stu1    Ritika    Singh  Science     96    A+
3  HC4       stu1    Ritika    Singh  English     94     A